In [1]:
import pandas as pd

In [2]:


import pandas as pd
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando", 'NJ'],
    "temperature": [21,14,35, 25],
})



df2 = pd.DataFrame({
    "city": ["chicago","new york","orlando"],
    "humidity": [65,68,75],
})

In [3]:
df1

       city  temperature
0  new york           21
1   chicago           14
2   orlando           35
3        NJ           25

In [4]:
df2

       city  humidity
0   chicago        65
1  new york        68
2   orlando        75

In [5]:
df3 = pd.merge(df1, df2, on = 'city') # default inner join how = 'inner'

In [6]:
df3

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

# Types of database join

<img src="https://www.datasciencemadesimple.com/wp-content/uploads/2017/09/join-or-merge-in-python-pandas-1.png">

In [7]:
df3 = pd.merge(df1, df2, on = 'city', how = 'outer') # default inner join how = 'inner'

In [8]:
df3

       city  temperature  humidity
0  new york           21      68.0
1   chicago           14      65.0
2   orlando           35      75.0
3        NJ           25       NaN

In [9]:
df3 = pd.merge(df1, df2, on = 'city', how = 'left') # left x is df1 and right y is df2

In [10]:
df3

       city  temperature  humidity
0  new york           21      68.0
1   chicago           14      65.0
2   orlando           35      75.0
3        NJ           25       NaN

In [11]:
df3 = pd.merge(df2, df1, on = 'city', how = 'left') 
df3

       city  humidity  temperature
0   chicago        65           14
1  new york        68           21
2   orlando        75           35

In [12]:
df3 = pd.merge(df1, df2, on = 'city', how = 'right') # right outer join

In [13]:
df3

       city  temperature  humidity
0   chicago           14        65
1  new york           21        68
2   orlando           35        75